In [27]:
num = 0

for i in range(1, 10):
    num += i
    print(num)

1
3
6
10
15
21
28
36
45

In [28]:
def num():
    squares = []
    for i in range(1, 10):
        squares.append(i**2)
    return squares  
print(num())

[1, 4, 9, 16, 25, 36, 49, 64, 81]

In [29]:
num = lambda x: x**2
print(num(3))

9

In [30]:
names = ["Ravi", "Pooja", "Vijay", "Kiran"]
names

new_list = []
for x in names:
    new_list.append("Hello " + x)

print(new_list)

['Hello Ravi', 'Hello Pooja', 'Hello Vijay', 'Hello Kiran']

In [31]:
cube = lambda x: x*3

for cube in range(1, 10):
    print(cube)

1
2
3
4
5
6
7
8
9

In [32]:
str = "Hello World"
lambda x: x[1]
print(str)

Hello World

Sure! Here are the lambda functions for each of the tasks:

1. **Lambda function that returns the first character of a string:**

In [33]:
first_char = lambda s: s[0]
print(first_char("Hello"))  # Output: H

H



2. **Lambda function that checks if a number is greater than 10:**

In [34]:
greater_than_10 = lambda x: x > 10
print(greater_than_10(15))  # Output: True
print(greater_than_10(5))   # Output: False

True
False



3. **Lambda function that returns the last character of a string:**

In [35]:
last_char = lambda s: s[-1]
print(last_char("Hello"))  # Output: o

o



4. **Lambda function that takes a list and returns the sum of its elements:**

In [36]:
sum_list = lambda lst: sum(lst)
print(sum_list([1, 2, 3, 4, 5]))  # Output: 15

15

In [37]:
str = "Hello World"
last_char = lambda s: s[-1]
print(last_char(str))  # Output: d

d

In [38]:
map(lambda x: x**2, [1, 2, 3, 4, 5])
list(map(lambda x: x**2, [1, 2, 3, 4, 5]))  # Output: [1, 4, 9, 16, 25]

[1, 4, 9, 16, 25]

In [39]:
9/5

1.8

In [40]:
10 * 9/5

18.0

Sure! Here are the examples using `map()` with lambda functions for each of the tasks:

1. **Convert a list of temperatures from Celsius to Fahrenheit:**

In [41]:
celsius = [0, 10, 20, 30, 40]
fahrenheit = list(map(lambda x: (x * 9/5) + 32, celsius))
print(fahrenheit)  # Output: [32.0, 50.0, 68.0, 86.0, 104.0]

[32.0, 50.0, 68.0, 86.0, 104.0]



2. **Square each number in a list:**

In [42]:
numbers = [1, 2, 3, 4, 5]
squared_numbers = list(map(lambda x: x**2, numbers))
print(squared_numbers)  # Output: [1, 4, 9, 16, 25]

[1, 4, 9, 16, 25]



3. **Prepend the string "Hello, " to each name in a list of names:**

In [43]:
names = ["Alice", "Bob", "Charlie"]
greeted_names = list(map(lambda name: f"Hello, {name}", names))
print(greeted_names)  # Output: ['Hello, Alice', 'Hello, Bob', 'Hello, Charlie']

['Hello, Alice', 'Hello, Bob', 'Hello, Charlie']



4. **Calculate the length of each string in a list of strings:**

In [44]:
strings = ["apple", "banana", "cherry"]
lengths = list(map(lambda s: len(s), strings))
print(lengths)  # Output: [5, 6, 6]

[5, 6, 6]



5. **Add 100 to each element in a list of numbers:**

In [2]:
numbers = [1, 2, 3, 4, 5]
added_numbers = list(map(lambda x: x + 100, numbers))
print(added_numbers)  # Output: [101, 102, 103, 104, 105]

[101, 102, 103, 104, 105]

In [46]:
numbers = [-1, 2, -3, -4, 5]
positive = list(filter(lambda x: x >0, numbers))
print(positive)  # Output: [2, 5]

[2, 5]

Sure! Here are the examples using `filter()` with lambda functions for each of the tasks:

1. **Select all even numbers from a list:**

Sure! Here are the examples using `reduce()` with lambda functions for each of the tasks. Note that `reduce()` is part of the `functools` module, so you need to import it first.

1. **Find the maximum number in a list:**

In [47]:
from functools import reduce

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
max_number = reduce(lambda a, b: a if a > b else b, numbers)
print(max_number)  # Output: 10

10



2. **Concatenate a list of strings into a single string:**

In [48]:
from functools import reduce

strings = ["Hello", "world", "this", "is", "Python"]
concatenated_string = reduce(lambda a, b: a + " " + b, strings)
print(concatenated_string)  # Output: "Hello world this is Python"

Hello world this is Python



3. **Compute the sum of all elements in a list:**

In [49]:
from functools import reduce

numbers = [1, 2, 3, 4, 5]
sum_of_numbers = reduce(lambda a, b: a + b, numbers)
print(sum_of_numbers)  # Output: 15

15



4. **Multiply all elements in a list:**

In [50]:
from functools import reduce

numbers = [1, 2, 3, 4, 5]
product_of_numbers = reduce(lambda a, b: a * b, numbers)
print(product_of_numbers)  # Output: 120

120



5. **Find the minimum number in a list:**

In [51]:
from functools import reduce

numbers = [1, 2, 3, 4, 5, -1, 0]
min_number = reduce(lambda a, b: a if a < b else b, numbers)
print(min_number)  # Output: -1

-1



You can add these code snippets to your prac.ipynb file. Here is how you can include them:

In [52]:
from functools import reduce

# Find the maximum number in a list
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
max_number = reduce(lambda a, b: a if a > b else b, numbers)
print(max_number)  # Output: 10

# Concatenate a list of strings into a single string
strings = ["Hello", "world", "this", "is", "Python"]
concatenated_string = reduce(lambda a, b: a + " " + b, strings)
print(concatenated_string)  # Output: "Hello world this is Python"

# Compute the sum of all elements in a list
numbers = [1, 2, 3, 4, 5]
sum_of_numbers = reduce(lambda a, b: a + b, numbers)
print(sum_of_numbers)  # Output: 15

# Multiply all elements in a list
numbers = [1, 2, 3, 4, 5]
product_of_numbers = reduce(lambda a, b: a * b, numbers)
print(product_of_numbers)  # Output: 120

# Find the minimum number in a list
numbers = [1, 2, 3, 4, 5, -1, 0]
min_number = reduce(lambda a, b: a if a < b else b, numbers)
print(min_number)  # Output: -1

10
Hello world this is Python
15
120
-1

In [53]:
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
even_numbers = list(filter(lambda x: x % 2 == 0, numbers))
print(even_numbers)  # Output: [2, 4, 6, 8, 10]

[2, 4, 6, 8, 10]



2. **Get all names that start with the letter 'A' from a list of names:**

In [54]:
names = ["Alice", "Bob", "Charlie", "Anna", "Albert"]
a_names = list(filter(lambda name: name.startswith('A'), names))
print(a_names)  # Output: ['Alice', 'Anna', 'Albert']

['Alice', 'Anna', 'Albert']



3. **Extract all strings longer than 5 characters from a list:**

In [55]:
strings = ["apple", "banana", "cherry", "date", "fig", "grape"]
long_strings = list(filter(lambda s: len(s) > 5, strings))
print(long_strings)  # Output: ['banana', 'cherry']

['banana', 'cherry']



4. **Select numbers greater than 50 from a list:**

In [56]:
numbers = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
greater_than_50 = list(filter(lambda x: x > 50, numbers))
print(greater_than_50)  # Output: [60, 70, 80, 90, 100]

[60, 70, 80, 90, 100]



5. **Get all positive numbers from a list of integers:**

In [57]:
integers = [-10, -5, 0, 5, 10, 15, -20, 25]
positive_numbers = list(filter(lambda x: x > 0, integers))
print(positive_numbers)  # Output: [5, 10, 15, 25]

[5, 10, 15, 25]

In [58]:
words = ["apple", "banana", "cherry", "date", "fig", "grape"]
words_with_a = [word[1] for word in words]
print(words_with_a)

['p', 'a', 'h', 'a', 'i', 'r']

In [59]:
a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

b = [num for num in a if num % 4 == 0]
print(b)

[4, 8, 12, 16, 20]

Sure! Here are the examples using list comprehensions for each of the tasks:

1. **Create a list of squares of numbers from 1 to 10:**

In [60]:
squares = [x**2 for x in range(1, 11)]
print(squares)  # Output: [1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]



2. **Filter out all odd numbers from a list:**

In [61]:
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
even_numbers = [x for x in numbers if x % 2 == 0]
print(even_numbers)  # Output: [2, 4, 6, 8, 10]

[2, 4, 6, 8, 10]



3. **Create a list of strings that are capitalized versions of a given list:**

In [62]:
words = ["hello", "world", "python", "programming"]
capitalized_words = [word.capitalize() for word in words]
print(capitalized_words)  # Output: ['Hello', 'World', 'Python', 'Programming']

['Hello', 'World', 'Python', 'Programming']



4. **Extract the first letter of each word in a list of words:**

In [63]:
words = ["apple", "banana", "cherry", "date"]
first_letters = [word[0] for word in words]
print(first_letters)  # Output: ['a', 'b', 'c', 'd']

['a', 'b', 'c', 'd']



5. **Create a list of numbers from 1 to 20 that are divisible by 4:**

In [64]:
divisible_by_4 = [x for x in range(1, 21) if x % 4 == 0]
print(divisible_by_4)  # Output: [4, 8, 12, 16, 20]

[4, 8, 12, 16, 20]

**Date TIme python**

In [4]:
import csv
from datetime import datetime
now = datetime.now()

In [66]:
now.strftime("%Y-%m-%d %H:%M:%S") # convert datetime to string

'2025-03-11 17:14:34'

In [67]:
now.strptime("2021-09-01", "%Y-%m-%d") # convert string to datetime

datetime.datetime(2021, 9, 1, 0, 0)

In [5]:
dob = input('enter your dob :')  # Example date of birth
birth_year = datetime.strptime(dob, "%Y-%m-%d")

age = now.year - birth_year.year
print(f'Your age is {age}')

Your age is 21

In [ ]:
import pandas as pd
data = pd.read_csv('day16_emp_data.csv')

display(data)

,ID,Full Name,Job Title,Department,Gender,Age,Hire Date,Salary,Country,City,Exit Date
0,E02002,Kai Le,Controls Engineer,Engineering,Male,47.0,02/05/22,"$92,368",United States,Columbus,NaN
1,E02003,Robert Patel,Analyst,Sales,Male,58.0,10/23/2013,"$45,703",United States,Chicago,NaN
2,E02004,Cameron Lo,Network Administrator,IT,Male,34.0,3/24/2019,"$83,576",China,Shanghai,NaN
3,E02005,Harper Castillo,IT Systems Architect,IT,Female,39.0,04/07/18,"$98,062",United States,Seattle,NaN
4,E02006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Austin,NaN
5,E02007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Phoenix,2/14/2014
6,E02008,Jade Hu,Sr. Analyst,Accounting,Female,58.0,6/27/2009,"$89,744",China,Chongqing,NaN
7,E02009,Miles Chang,Analyst II,Finance,Male,62.0,2/19/1999,"$69,674",China,Chengdu,NaN
8,E02010,Gianna Holmes,System Administrator†,IT,Female,38.0,09/09/11,"$97,630",United States,Seattle,NaN
9,E02011,Jameson Thomas,Manager,Finance,Male,52.0,02/05/15,"$105,879",United States,Miami,NaN
10,E02012,Jameson Pena,Systems Analyst,IT,Male,49.0,10/12/03,"$40,499",United States,Miami,NaN
11,E02013,Bella Wu,NaN,Finance,Female,63.0,NaN,"$71,418",NaN,Phoenix,NaN
12,E02014,Jose Wong,NaN,IT,Male,45.0,NaN,"$150,558",NaN,Chongqing,NaN
13,E02015,Lucas Richardson,NaN,Marketing,Male,36.0,NaN,"$118,912",NaN,Miami,NaN
14,E02016,Jacob Moore,Sr. Manager,Marketing,Male,42.0,NaN,"$131,422",NaN,Phoenix,NaN
15,E02017,Luna Lu,IT Systems Architect,IT,Female,62.0,NaN,"$64,208",United States,Miami,NaN
16,E02018,Bella Tran,Vice President,Engineering,Female,45.0,NaN,"$254,486",China,Chengdu,NaN
17,E02019,Ivy Chau,Analyst,Sales,Female,61.0,NaN,"$54,811",China,Chongqing,NaN
18,E02020,Jordan Kumar,Service Desk Analyst,IT,Male,29.0,11/11/17,"$95,729",United States,Seattle,NaN
19,E02021,Sophia Gutierrez,Manager,Accounting,Female,63.0,02/08/09,"$102,649",United States,Austin,NaN
20,E02022,Eli Dang,Sr. Manager,Accounting,Male,45.0,11/16/2015,"$122,875",United States,Chicago,NaN
21,E02023,Lillian Lewis,Technical Architect,IT,Female,43.0,8/14/2013,"$83,323",United States,Phoenix,3/31/2019
22,E02024,Serenity Cao,Account Representative,Sales,Female,31.0,10/21/2018,"$66,721",China,Shanghai,NaN

In [ ]:
# data_id = data.set_index('ID')

data_new = data_id.to_excel('day16_emp_data.xlsx')
print(data_new)

None

In [ ]:
def count_up_to(n):
  """Yields numbers from 1 to n."""
  for i in range(1, n + 1):
    yield i

for number in count_up_to(5):
  print(number) # Output: 1 2 3 4 5

1
2
3
4
5

In [2]:
story = input("Enter a story")
words = story.strip('')           # Remove leading and trailing spaces
words = words.replace(',', ' ')  # Replace commas with spaces
 
store_list = words.split(' ')

result = len(store_list)
print(f"Total words: {result}")

Total words: 5

In [ ]:
str = "Hello World"

rev = ""

num = len(str)-1
# print(num)    # 

while num >= 0:         # This loop iterates backwards through the string till it reaches the beginning.
    rev += str[num]     # what it does? Answers: It appends the character at index num to the rev string.
    num -= 1            # This decrements num by 1 to move to the previous character in the string.
print(rev)

dlroW olleH